In [6]:
import numpy as np
import pandas as pd
d = {'ID': ['A', 'B','C','D'],
     'Name': ['John', 'Anna','Mike','Bob'], 'Value': np.random.randn(4)}
left = pd.DataFrame(data=d)
left

  ID  Name     Value
0  A  John  1.165927
1  B  Anna  0.530534
2  C  Mike -0.547544
3  D   Bob  0.475547

In [10]:
f = {'User_Name': ['Wendy', 'Anna','Mike','Bob'], 'Color':['Blue','Red','Yellow','White'] }
right=pd.DataFrame(data=f)
right

  User_Name   Color
0     Wendy    Blue
1      Anna     Red
2      Mike  Yellow
3       Bob   White

In [15]:
right2=right.rename(columns={"User_Name": "Name"})
right2

    Name   Color
0  Wendy    Blue
1   Anna     Red
2   Mike  Yellow
3    Bob   White

In [16]:
left.merge(right2, on='Name', how='left', indicator=True)

  ID  Name     Value   Color     _merge
0  A  John  1.165927     NaN  left_only
1  B  Anna  0.530534     Red       both
2  C  Mike -0.547544  Yellow       both
3  D   Bob  0.475547   White       both

In [18]:
data = {"Name": ["James", "Alice", "Phil", "James"], 
        "Age": [24, 28, 40, 25],
        "Sex": ["Male", "Female", "Male", "Male"]}
df = pd.DataFrame(data)
print(df)

    Name  Age     Sex
0  James   24    Male
1  Alice   28  Female
2   Phil   40    Male
3  James   25    Male

In [19]:
df = df.sort_values('Age', ascending=False)
df = df.drop_duplicates(subset='Name', keep='first')
print(df)

    Name  Age     Sex
2   Phil   40    Male
1  Alice   28  Female
3  James   25    Male